nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm4/pin_mux.h
/* GPIO_AD_24 (coord L13), VDC3_ADC2_A6 */
/* Routed pin properties */
#define BOARD_INITADCPINS_VDC3_ADC2_A6_LPUART1_TX_PERIPHERAL              LPADC2   /*!< Peripheral name */
#define BOARD_INITADCPINS_VDC3_ADC2_A6_LPUART1_TX_SIGNAL                       A   /*!< Signal name */
#define BOARD_INITADCPINS_VDC3_ADC2_A6_LPUART1_TX_CHANNEL                     2U   /*!< Signal channel */

/* GPIO_AD_19 (coord L16), IB4_ADC2_B0 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IB4_ADC2_B0_PERIPHERAL                          LPADC2   /*!< Peripheral name */
#define BOARD_INITADCPINS_IB4_ADC2_B0_SIGNAL                                   B   /*!< Signal name */
#define BOARD_INITADCPINS_IB4_ADC2_B0_CHANNEL                                 2U   /*!< Signal channel */

/* GPIO_AD_21 (coord K14), IDC3_ADC2_B1 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IDC3_ADC2_B1_PERIPHERAL                         LPADC2   /*!< Peripheral name */
#define BOARD_INITADCPINS_IDC3_ADC2_B1_SIGNAL                                  B   /*!< Signal name */
#define BOARD_INITADCPINS_IDC3_ADC2_B1_CHANNEL                                2U   /*!< Signal channel */

/* GPIO_AD_23 (coord J12), IDC4_ADC2_B2 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IDC4_ADC2_B2_PERIPHERAL                         LPADC2   /*!< Peripheral name */
#define BOARD_INITADCPINS_IDC4_ADC2_B2_SIGNAL                                  B   /*!< Signal name */
#define BOARD_INITADCPINS_IDC4_ADC2_B2_CHANNEL                                2U   /*!< Signal channel */

/* GPIO_AD_25 (coord M15), VDC4_ADC2_B6 */
/* Routed pin properties */
#define BOARD_INITADCPINS_VDC4_ADC2_B6_LPUART1_RX_PERIPHERAL              LPADC2   /*!< Peripheral name */
#define BOARD_INITADCPINS_VDC4_ADC2_B6_LPUART1_RX_SIGNAL                       B   /*!< Signal name */
#define BOARD_INITADCPINS_VDC4_ADC2_B6_LPUART1_RX_CHANNEL                     2U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitAdcPins(void);                 /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_23 (coord B2), PWM1_A0 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM1_A0_PERIPHERAL                                PWM1   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM1_A0_SIGNAL                                       A   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM1_A0_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_EMC_B1_25 (coord J4), PWM1_A1 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM1_A1_PERIPHERAL                                PWM1   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM1_A1_SIGNAL                                       A   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM1_A1_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_EMC_B1_27 (coord G5), PWM1_A2 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM1_A2_PERIPHERAL                                PWM1   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM1_A2_SIGNAL                                       A   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM1_A2_CHANNEL                                     2U   /*!< Signal channel */

/* GPIO_EMC_B1_24 (coord J5), PWM1_B0 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM1_B0_PERIPHERAL                                PWM1   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM1_B0_SIGNAL                                       B   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM1_B0_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_EMC_B1_26 (coord J3), PWM1_B1 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM1_B1_PERIPHERAL                                PWM1   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM1_B1_SIGNAL                                       B   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM1_B1_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_EMC_B1_28 (coord E5), PWM1_B2 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM1_B2_PERIPHERAL                                PWM1   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM1_B2_SIGNAL                                       B   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM1_B2_CHANNEL                                     2U   /*!< Signal channel */

/* GPIO_EMC_B1_06 (coord H4), PWM2_A0 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM2_A0_PERIPHERAL                                PWM2   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM2_A0_SIGNAL                                       A   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM2_A0_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_EMC_B1_08 (coord F5), PWM2_A1 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM2_A1_PERIPHERAL                                PWM2   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM2_A1_SIGNAL                                       A   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM2_A1_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_EMC_B1_10 (coord A2), PWM2_A2 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM2_A2_PERIPHERAL                                PWM2   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM2_A2_SIGNAL                                       A   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM2_A2_CHANNEL                                     2U   /*!< Signal channel */

/* GPIO_EMC_B1_07 (coord H3), PWM2_B0 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM2_B0_PERIPHERAL                                PWM2   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM2_B0_SIGNAL                                       B   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM2_B0_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_EMC_B1_09 (coord A3), PWM2_B1 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM2_B1_PERIPHERAL                                PWM2   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM2_B1_SIGNAL                                       B   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM2_B1_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_EMC_B1_11 (coord C2), PWM2_B2 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM2_B2_PERIPHERAL                                PWM2   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM2_B2_SIGNAL                                       B   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM2_B2_CHANNEL                                     2U   /*!< Signal channel */

/* GPIO_EMC_B1_29 (coord E6), PWM3_A0 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM3_A0_PERIPHERAL                                PWM3   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM3_A0_SIGNAL                                       A   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM3_A0_CHANNEL                                     0U   /*!< Signal channel */

