nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm4/pin_mux.h
/* GPIO_EMC_B1_21 (coord G2), SPI2_MISO_FXIO1_D21 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_MISO_FXIO1_D21_PERIPHERAL      FLEXIO1   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_MISO_FXIO1_D21_SIGNAL               IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_MISO_FXIO1_D21_CHANNEL             21U   /*!< Signal channel */

/* GPIO_EMC_B1_22 (coord H2), SPI2_MOSI_FXIO1_D22 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_MOSI_FXIO1_D22_PERIPHERAL      FLEXIO1   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_MOSI_FXIO1_D22_SIGNAL               IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_MOSI_FXIO1_D22_CHANNEL             22U   /*!< Signal channel */

/* GPIO_AD_04 (coord M13), SPI3_SCK_FXIO2_D04 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_SCK_FXIO2_D04_PERIPHERAL       FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_SCK_FXIO2_D04_SIGNAL                IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_SCK_FXIO2_D04_CHANNEL               4U   /*!< Signal channel */

/* GPIO_AD_05 (coord P13), SPI3_CS_FXIO2_D05 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_CS_FXIO2_D05_PERIPHERAL        FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_CS_FXIO2_D05_SIGNAL                 IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_CS_FXIO2_D05_CHANNEL                5U   /*!< Signal channel */

/* GPIO_AD_26 (coord L14), SPI3_MISO_FXIO2_D26 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_MISO_FXIO2_D26_PERIPHERAL      FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_MISO_FXIO2_D26_SIGNAL               IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_MISO_FXIO2_D26_CHANNEL             26U   /*!< Signal channel */

/* GPIO_AD_27 (coord N16), SPI3_MOSI_FXIO2_D27 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_MOSI_FXIO2_D27_PERIPHERAL      FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_MOSI_FXIO2_D27_SIGNAL               IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_MOSI_FXIO2_D27_CHANNEL             27U   /*!< Signal channel */

/* GPIO_AD_28 (coord L17), SPI4_SCK_FXIO2_D28 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_SCK_FXIO2_D28_PERIPHERAL       FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_SCK_FXIO2_D28_SIGNAL                IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_SCK_FXIO2_D28_CHANNEL              28U   /*!< Signal channel */

/* GPIO_AD_29 (coord M17), SPI4_CS_FXIO2_D29 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_CS_FXIO2_D29_PERIPHERAL        FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_CS_FXIO2_D29_SIGNAL                 IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_CS_FXIO2_D29_CHANNEL               29U   /*!< Signal channel */

/* GPIO_AD_30 (coord K17), SPI4_MISO_FXIO2_D30 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_MISO_FXIO2_D30_PERIPHERAL      FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_MISO_FXIO2_D30_SIGNAL               IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_MISO_FXIO2_D30_CHANNEL             30U   /*!< Signal channel */

/* GPIO_AD_31 (coord J17), SPI4_MOSI_FXIO2_D31 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_MOSI_FXIO2_D31_PERIPHERAL      FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_MOSI_FXIO2_D31_SIGNAL               IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_MOSI_FXIO2_D31_CHANNEL             31U   /*!< Signal channel */

/* GPIO_SNVS_08 (coord N9), SPI_CS_SEL0 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_SNVS_PERIPHERAL          GPIO13   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_SNVS_SIGNAL             gpio_io   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_SNVS_CHANNEL                11U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_SNVS_GPIO                GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_SNVS_GPIO_PIN               11U   /*!< GPIO pin number */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_SNVS_GPIO_PIN_MASK  (1U << 11U)   /*!< GPIO pin mask */

/* GPIO_SNVS_09 (coord R11), SPI_CS_SEL1 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_SNVS_PERIPHERAL          GPIO13   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_SNVS_SIGNAL             gpio_io   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_SNVS_CHANNEL                12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_SNVS_GPIO                GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_SNVS_GPIO_PIN               12U   /*!< GPIO pin number */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_SNVS_GPIO_PIN_MASK  (1U << 12U)   /*!< GPIO pin mask */

/* GPIO_LPSR_10 (coord R5), SPI_CS_SEL0 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_I2C6_SDA_PERIPHERAL      GPIO12   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_I2C6_SDA_SIGNAL         gpio_io   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_I2C6_SDA_CHANNEL            10U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_I2C6_SDA_GPIO            GPIO12   /*!< GPIO peripheral base pointer */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_I2C6_SDA_GPIO_PIN           10U   /*!< GPIO pin number */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_I2C6_SDA_GPIO_PIN_MASK (1U << 10U) /*!< GPIO pin mask */

/* GPIO_LPSR_11 (coord T5), SPI_CS_SEL1 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_I2C6_SCL_SWO_PERIPHERAL  GPIO12   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_I2C6_SCL_SWO_SIGNAL     gpio_io   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_I2C6_SCL_SWO_CHANNEL        11U   /*!< Signal channel */

