nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm4/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_I2C6_SCL_SWO_GPIO        GPIO12   /*!< GPIO peripheral base pointer */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_I2C6_SCL_SWO_GPIO_PIN       11U   /*!< GPIO pin number */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_I2C6_SCL_SWO_GPIO_PIN_MASK (1U << 11U) /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPowerStageSPIsPins(void);      /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B1_02 (coord D11), ENET_QOS_RX0 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX0_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX0_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX0_CHANNEL                          0U   /*!< Signal channel */

/* GPIO_DISP_B1_03 (coord E11), ENET_QOS_RX1 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX1_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX1_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX1_CHANNEL                          1U   /*!< Signal channel */

/* GPIO_DISP_B1_04 (coord E10), ENET_QOS_RX2 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX2_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX2_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX2_CHANNEL                          2U   /*!< Signal channel */

/* GPIO_DISP_B1_05 (coord C11), ENET_QOS_RX3 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX3_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX3_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX3_CHANNEL                          3U   /*!< Signal channel */

/* GPIO_DISP_B1_09 (coord C13), ENET_QOS_TX0 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX0_BOOT_CFG3_PERIPHERAL       ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX0_BOOT_CFG3_SIGNAL         enet_tdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX0_BOOT_CFG3_CHANNEL                0U   /*!< Signal channel */

/* GPIO_DISP_B1_08 (coord A15), ENET_QOS_TX1 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX1_BOOT_CFG2_PERIPHERAL       ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX1_BOOT_CFG2_SIGNAL         enet_tdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX1_BOOT_CFG2_CHANNEL                1U   /*!< Signal channel */

/* GPIO_DISP_B1_07 (coord E12), ENET_QOS_TX2 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX2_BOOT_CFG1_PERIPHERAL       ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX2_BOOT_CFG1_SIGNAL         enet_tdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX2_BOOT_CFG1_CHANNEL                2U   /*!< Signal channel */

/* GPIO_DISP_B1_06 (coord D10), ENET_QOS_TX3 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX3_BOOT_CFG0_PERIPHERAL       ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX3_BOOT_CFG0_SIGNAL         enet_tdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX3_BOOT_CFG0_CHANNEL                3U   /*!< Signal channel */

/* GPIO_DISP_B1_11 (coord A14), ENET_QOS_TX_CLK */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX_CLK_BOOT_CFG5_PERIPHERAL    ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX_CLK_BOOT_CFG5_SIGNAL     enet_tx_clk   /*!< Signal name */

/* GPIO_DISP_B1_01 (coord D13), ENET_QOS_RX_CLK */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX_CLK_PERIPHERAL              ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX_CLK_SIGNAL               enet_rx_clk   /*!< Signal name */

/* GPIO_DISP_B1_00 (coord E13), ENET_QOS_RX_EN */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX_EN_PERIPHERAL               ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX_EN_SIGNAL                 enet_rx_en   /*!< Signal name */

/* GPIO_DISP_B1_10 (coord B14), ENET_QOS_TX_EN */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX_EN_BOOT_CFG4_PERIPHERAL     ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX_EN_BOOT_CFG4_SIGNAL       enet_tx_en   /*!< Signal name */

/* GPIO_EMC_B2_19 (coord U2), ENET_QOS_MDC_3V3 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_MDC_3V3_PERIPHERAL             ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_MDC_3V3_SIGNAL                 enet_mdc   /*!< Signal name */

/* GPIO_EMC_B2_20 (coord R3), ENET_QOS_MDIO_3V3 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_MDIO_3V3_PERIPHERAL            ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_MDIO_3V3_SIGNAL               enet_mdio   /*!< Signal name */

/* GPIO_EMC_B2_18 (coord N3), ENET_QOS_PHY_INTB */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_PHY_INTB_PERIPHERAL               GPIO2   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_PHY_INTB_SIGNAL             gpio_mux_io   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_PHY_INTB_CHANNEL                    28U   /*!< Signal channel */

/* GPIO_LPSR_12 (coord U5), ENET_QOS_PHY_RST_B */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_PHY_RST_B_PERIPHERAL              GPIO6   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_PHY_RST_B_SIGNAL            gpio_mux_io   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_PHY_RST_B_CHANNEL                   12U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTsnEnet1GPins(void);           /* Function assigned for the Cortex-M7F */

/* GPIO_LPSR_14 (coord T6), SWD_CLK */
/* Routed pin properties */
#define BOARD_INITDEBUGPINS_SWD_CLK_JTAG_CLK_PERIPHERAL                     JTAG   /*!< Peripheral name */
#define BOARD_INITDEBUGPINS_SWD_CLK_JTAG_CLK_SIGNAL                          TCK   /*!< Signal name */

