nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm4/pin_mux.h
/* GPIO_LPSR_15 (coord U7), SWD_IO */
/* Routed pin properties */
#define BOARD_INITDEBUGPINS_SWD_DIO_JTAG_TMS_PERIPHERAL                     JTAG   /*!< Peripheral name */
#define BOARD_INITDEBUGPINS_SWD_DIO_JTAG_TMS_SIGNAL                          TMS   /*!< Signal name */

/* GPIO_LPSR_13 (coord U6), JTAG_MOD */
/* Routed pin properties */
#define BOARD_INITDEBUGPINS_JTAG_MOD_PERIPHERAL                             JTAG   /*!< Peripheral name */
#define BOARD_INITDEBUGPINS_JTAG_MOD_SIGNAL                                  MOD   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDebugPins(void);               /* Function assigned for the Cortex-M7F */

/* GPIO_SD_B1_05 (coord A16), SD1_D3 */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_D3_PERIPHERAL                                USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_D3_SIGNAL                                usdhc_data   /*!< Signal name */
#define BOARD_INITSDPINS_SD1_D3_CHANNEL                                       3U   /*!< Signal channel */

/* GPIO_SD_B1_04 (coord B15), SD1_D2 */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_D2_PERIPHERAL                                USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_D2_SIGNAL                                usdhc_data   /*!< Signal name */
#define BOARD_INITSDPINS_SD1_D2_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_SD_B1_03 (coord B17), SD1_D1 */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_D1_PERIPHERAL                                USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_D1_SIGNAL                                usdhc_data   /*!< Signal name */
#define BOARD_INITSDPINS_SD1_D1_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_SD_B1_02 (coord C15), SD1_D0 */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_D0_PERIPHERAL                                USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_D0_SIGNAL                                usdhc_data   /*!< Signal name */
#define BOARD_INITSDPINS_SD1_D0_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_SD_B1_01 (coord D15), SD1_CLK */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_CLK_PERIPHERAL                               USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_CLK_SIGNAL                                usdhc_clk   /*!< Signal name */

/* GPIO_SD_B1_00 (coord B16), SD1_CMD */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_CMD_PERIPHERAL                               USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_CMD_SIGNAL                                usdhc_cmd   /*!< Signal name */

/* GPIO_AD_32 (coord K16), SD1_CD_B */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_CD_B_PERIPHERAL                              USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_CD_B_SIGNAL                              usdhc_cd_b   /*!< Signal name */

/* GPIO_AD_34 (coord J16), SD1_VSELECT */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_VSELECT_PERIPHERAL                           USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_VSELECT_SIGNAL                        usdhc_vselect   /*!< Signal name */

/* GPIO_AD_35 (coord G17), SD_PWREN_B */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD_PWREN_B_PERIPHERAL                            USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD_PWREN_B_SIGNAL                         usdhc_reset_b   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSdPins(void);                  /* Function assigned for the Cortex-M7F */

/* GPIO_SD_B2_08 (coord F15), FLEXSPI1_A_D0 */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_D0_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_D0_SIGNAL           FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_SD_B2_09 (coord H15), FLEXSPI1_A_D1 */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_D1_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_D1_SIGNAL           FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_SD_B2_10 (coord H14), FLEXSPI1_A_D2 */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_D2_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_D2_SIGNAL           FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_SD_B2_11 (coord F16), FLEXSPI1_A_D3 */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_D3_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_D3_SIGNAL           FLEXSPI_A_DATA3   /*!< Signal name */

/* GPIO_SD_B2_05 (coord E14), FLEXSPI1_A_DQS */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_DQS_PERIPHERAL             FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_DQS_SIGNAL            FLEXSPI_A_DQS   /*!< Signal name */

/* GPIO_SD_B2_07 (coord G14), FLEXSPI1_A_CLK */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_CLK_PERIPHERAL             FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_CLK_SIGNAL           FLEXSPI_A_SCLK   /*!< Signal name */

/* GPIO_SD_B2_03 (coord E15), FLEXSPI1_B_D0 */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_B_D0_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_B_D0_SIGNAL           FLEXSPI_B_DATA0   /*!< Signal name */

/* GPIO_SD_B2_02 (coord H13), FLEXSPI1_B_D1 */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_B_D1_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_B_D1_SIGNAL           FLEXSPI_B_DATA1   /*!< Signal name */

/* GPIO_SD_B2_01 (coord J14), FLEXSPI1_B_D2 */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_B_D2_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_B_D2_SIGNAL           FLEXSPI_B_DATA2   /*!< Signal name */

/* GPIO_SD_B2_00 (coord J15), FLEXSPI1_B_D3 */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_B_D3_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_B_D3_SIGNAL           FLEXSPI_B_DATA3   /*!< Signal name */

/* GPIO_SD_B2_04 (coord F14), FLEXSPI1_A_SS1_B_B_CLK */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_SS1_B_B_CLK_PERIPHERAL     FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_SS1_B_B_CLK_SIGNAL  FLEXSPI_A_SS1_B   /*!< Signal name */

/* GPIO_SD_B2_06 (coord F17), FLEXSPI1_A_SS0_B */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_SS0_B_PERIPHERAL           FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI1PINS_FLEXSPI1_A_SS0_B_SIGNAL        FLEXSPI_A_SS0_B   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitXipFlexSPI1Pins(void);         /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B2_10 (coord R2), FLEXSPI2_A_SCK */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI2PINS_FLEXSPI2_A_SCK_PERIPHERAL             FLEXSPI2   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI2PINS_FLEXSPI2_A_SCK_SIGNAL           FLEXSPI_A_SCLK   /*!< Signal name */

