nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm4/pin_mux.h
/* GPIO_EMC_B2_11 (coord L4), FLEXSPI2_A_SS_B */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI2PINS_FLEXSPI2_A_SS_B_PERIPHERAL            FLEXSPI2   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI2PINS_FLEXSPI2_A_SS_B_SIGNAL         FLEXSPI_A_SS0_B   /*!< Signal name */

/* GPIO_EMC_B2_13 (coord K5), FLEXSPI2_A_D0 */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI2PINS_FLEXSPI2_A_D0_PERIPHERAL              FLEXSPI2   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI2PINS_FLEXSPI2_A_D0_SIGNAL           FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_EMC_B2_14 (coord M4), FLEXSPI2_A_D1 */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI2PINS_FLEXSPI2_A_D1_PERIPHERAL              FLEXSPI2   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI2PINS_FLEXSPI2_A_D1_SIGNAL           FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_EMC_B2_15 (coord L2), FLEXSPI2_A_D2 */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI2PINS_FLEXSPI2_A_D2_PERIPHERAL              FLEXSPI2   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI2PINS_FLEXSPI2_A_D2_SIGNAL           FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_EMC_B2_16 (coord P2), FLEXSPI2_A_D3 */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI2PINS_FLEXSPI2_A_D3_PERIPHERAL              FLEXSPI2   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI2PINS_FLEXSPI2_A_D3_SIGNAL           FLEXSPI_A_DATA3   /*!< Signal name */

/* GPIO_EMC_B2_12 (coord M2), FLEXSPI2_A_DQS */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI2PINS_FLEXSPI2_A_DQS_PERIPHERAL             FLEXSPI2   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI2PINS_FLEXSPI2_A_DQS_SIGNAL            FLEXSPI_A_DQS   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLogFlexSPI2Pins(void);         /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSdpUart1Pins(void);            /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_40 (coord K1), LPUART6_TX */
/* Routed pin properties */
#define BOARD_INITDEBUGUARTSPINS_LPUART6_TX_CCM_CLKO1_PERIPHERAL         LPUART6   /*!< Peripheral name */
#define BOARD_INITDEBUGUARTSPINS_LPUART6_TX_CCM_CLKO1_SIGNAL                 TXD   /*!< Signal name */

/* GPIO_EMC_B1_41 (coord L1), LPUART6_RX */
/* Routed pin properties */
#define BOARD_INITDEBUGUARTSPINS_LPUART6_RX_CCM_CLKO2_PERIPHERAL         LPUART6   /*!< Peripheral name */
#define BOARD_INITDEBUGUARTSPINS_LPUART6_RX_CCM_CLKO2_SIGNAL                 RXD   /*!< Signal name */

/* GPIO_DISP_B2_08 (coord B5), LPUART8_TX */
/* Routed pin properties */
#define BOARD_INITDEBUGUARTSPINS_LPUART8_TX_PERIPHERAL                   LPUART8   /*!< Peripheral name */
#define BOARD_INITDEBUGUARTSPINS_LPUART8_TX_SIGNAL                           TXD   /*!< Signal name */

/* GPIO_DISP_B2_09 (coord D8), LPUART8_RX */
/* Routed pin properties */
#define BOARD_INITDEBUGUARTSPINS_LPUART8_RX_PERIPHERAL                   LPUART8   /*!< Peripheral name */
#define BOARD_INITDEBUGUARTSPINS_LPUART8_RX_SIGNAL                           RXD   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDebugUartsPins(void);          /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B2_12 (coord B6), SECURE_CAN1_TX */
/* Routed pin properties */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_TX_PERIPHERAL                  CAN1   /*!< Peripheral name */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_TX_SIGNAL                        TX   /*!< Signal name */

/* GPIO_DISP_B2_13 (coord A5), SECURE_CAN1_RX */
/* Routed pin properties */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_RX_PERIPHERAL                  CAN1   /*!< Peripheral name */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_RX_SIGNAL                        RX   /*!< Signal name */

/* GPIO_DISP_B2_14 (coord A7), SECURE_CAN1_STBY */
/* Routed pin properties */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_STBY_PERIPHERAL              GPIO11   /*!< Peripheral name */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_STBY_SIGNAL                 gpio_io   /*!< Signal name */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_STBY_CHANNEL                    15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_STBY_GPIO                    GPIO11   /*!< GPIO peripheral base pointer */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_STBY_GPIO_PIN                   15U   /*!< GPIO pin number */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_STBY_GPIO_PIN_MASK      (1U << 15U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSecureCan1Pins(void);          /* Function assigned for the Cortex-M7F */

/* GPIO_LPSR_00 (coord N6), CAN3_TX */
/* Routed pin properties */
#define BOARD_INITCANSPINS_CAN3_TX_PERIPHERAL                               CAN3   /*!< Peripheral name */
#define BOARD_INITCANSPINS_CAN3_TX_SIGNAL                                     TX   /*!< Signal name */

/* GPIO_LPSR_01 (coord R6), CAN3_RX */
/* Routed pin properties */
#define BOARD_INITCANSPINS_CAN3_RX_PERIPHERAL                               CAN3   /*!< Peripheral name */
#define BOARD_INITCANSPINS_CAN3_RX_SIGNAL                                     RX   /*!< Signal name */

/* GPIO_LPSR_02 (coord P6), CAN3_STBY */
/* Routed pin properties */
#define BOARD_INITCANSPINS_CAN3_STBY_BOOT_MODE0_PERIPHERAL                GPIO12   /*!< Peripheral name */
#define BOARD_INITCANSPINS_CAN3_STBY_BOOT_MODE0_SIGNAL                   gpio_io   /*!< Signal name */
#define BOARD_INITCANSPINS_CAN3_STBY_BOOT_MODE0_CHANNEL                       2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITCANSPINS_CAN3_STBY_BOOT_MODE0_GPIO                      GPIO12   /*!< GPIO peripheral base pointer */
#define BOARD_INITCANSPINS_CAN3_STBY_BOOT_MODE0_GPIO_PIN                      2U   /*!< GPIO pin number */
#define BOARD_INITCANSPINS_CAN3_STBY_BOOT_MODE0_GPIO_PIN_MASK         (1U << 2U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCansPins(void);                /* Function assigned for the Cortex-M7F */

/* GPIO_AD_00 (coord N12), RS485_RXD */
/* Routed pin properties */
#define BOARD_INITRS485PINS_RS485_RXD_PERIPHERAL                         LPUART7   /*!< Peripheral name */
#define BOARD_INITRS485PINS_RS485_RXD_SIGNAL                                 TXD   /*!< Signal name */

