nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm4/pin_mux.h
/* GPIO_DISP_B2_10 (coord D9), I2C3_SCL */
/* Routed pin properties */
#define BOARD_INITI2CPINS_I2C3_SCL_PERIPHERAL                             LPI2C3   /*!< Peripheral name */
#define BOARD_INITI2CPINS_I2C3_SCL_SIGNAL                                    SCL   /*!< Signal name */

/* GPIO_DISP_B2_11 (coord A6), I2C3_SDA */
/* Routed pin properties */
#define BOARD_INITI2CPINS_I2C3_SDA_PERIPHERAL                             LPI2C3   /*!< Peripheral name */
#define BOARD_INITI2CPINS_I2C3_SDA_SIGNAL                                    SDA   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2cPins(void);                 /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B2_00 (coord E8), DIG_OUT_0 */
/* Routed pin properties */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_0_BOOT_CFG6_PERIPHERAL         GPIO5   /*!< Peripheral name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_0_BOOT_CFG6_SIGNAL       gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_0_BOOT_CFG6_CHANNEL               1U   /*!< Signal channel */

/* GPIO_DISP_B2_01 (coord F8), DIG_OUT_1 */
/* Routed pin properties */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_1_BOOT_CFG7_PERIPHERAL         GPIO5   /*!< Peripheral name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_1_BOOT_CFG7_SIGNAL       gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_1_BOOT_CFG7_CHANNEL               2U   /*!< Signal channel */

/* GPIO_DISP_B2_02 (coord E9), DIG_OUT_2 */
/* Routed pin properties */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_2_BOOT_CFG8_PERIPHERAL         GPIO5   /*!< Peripheral name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_2_BOOT_CFG8_SIGNAL       gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_2_BOOT_CFG8_CHANNEL               3U   /*!< Signal channel */

/* GPIO_DISP_B2_03 (coord D7), DIG_OUT_3 */
/* Routed pin properties */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_3_BOOT_CFG9_PERIPHERAL         GPIO5   /*!< Peripheral name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_3_BOOT_CFG9_SIGNAL       gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_3_BOOT_CFG9_CHANNEL               4U   /*!< Signal channel */

/* GPIO_SNVS_00 (coord R10), DIG_OUT_4 */
/* Routed pin properties */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_4_SNVS_PERIPHERAL             GPIO13   /*!< Peripheral name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_4_SNVS_SIGNAL                gpio_io   /*!< Signal name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_4_SNVS_CHANNEL                    3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_4_SNVS_GPIO                   GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_4_SNVS_GPIO_PIN                   3U   /*!< GPIO pin number */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_4_SNVS_GPIO_PIN_MASK      (1U << 3U)   /*!< GPIO pin mask */

/* GPIO_SNVS_01 (coord P10), DIG_OUT_5 */
/* Routed pin properties */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_5_SNVS_PERIPHERAL             GPIO13   /*!< Peripheral name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_5_SNVS_SIGNAL                gpio_io   /*!< Signal name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_5_SNVS_CHANNEL                    4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_5_SNVS_GPIO                   GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_5_SNVS_GPIO_PIN                   4U   /*!< GPIO pin number */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_5_SNVS_GPIO_PIN_MASK      (1U << 4U)   /*!< GPIO pin mask */

/* GPIO_SNVS_02 (coord L9), DIG_OUT_6 */
/* Routed pin properties */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_6_SNVS_PERIPHERAL             GPIO13   /*!< Peripheral name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_6_SNVS_SIGNAL                gpio_io   /*!< Signal name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_6_SNVS_CHANNEL                    5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_6_SNVS_GPIO                   GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_6_SNVS_GPIO_PIN                   5U   /*!< GPIO pin number */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_6_SNVS_GPIO_PIN_MASK      (1U << 5U)   /*!< GPIO pin mask */

/* GPIO_SNVS_03 (coord M10), DIG_OUT_7 */
/* Routed pin properties */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_7_SNVS_PERIPHERAL             GPIO13   /*!< Peripheral name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_7_SNVS_SIGNAL                gpio_io   /*!< Signal name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_7_SNVS_CHANNEL                    6U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_7_SNVS_GPIO                   GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_7_SNVS_GPIO_PIN                   6U   /*!< GPIO pin number */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_7_SNVS_GPIO_PIN_MASK      (1U << 6U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDigitalOutputPins(void);       /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_38 (coord J1), DIG_INPUT_0 */
/* Routed pin properties */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_0_PERIPHERAL                  GPIO2   /*!< Peripheral name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_0_SIGNAL                gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_0_CHANNEL                        6U   /*!< Signal channel */

/* GPIO_EMC_B1_39 (coord J2), DIG_INPUT_1 */
/* Routed pin properties */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_1_PERIPHERAL                  GPIO2   /*!< Peripheral name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_1_SIGNAL                gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_1_CHANNEL                        7U   /*!< Signal channel */

/* GPIO_EMC_B2_17 (coord T2), DIG_INPUT_2 */
/* Routed pin properties */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_2_PERIPHERAL                  GPIO2   /*!< Peripheral name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_2_SIGNAL                gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_2_CHANNEL                       27U   /*!< Signal channel */

/* GPIO_AD_33 (coord H17), DIG_INPUT_3 */
/* Routed pin properties */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_3_PERIPHERAL                  GPIO4   /*!< Peripheral name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_3_SIGNAL                gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_3_CHANNEL                        0U   /*!< Signal channel */

/* GPIO_SNVS_04 (coord N10), DIG_INPUT_4 */
/* Routed pin properties */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_4_SNVS_PERIPHERAL            GPIO13   /*!< Peripheral name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_4_SNVS_SIGNAL               gpio_io   /*!< Signal name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_4_SNVS_CHANNEL                   7U   /*!< Signal channel */

