nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm4/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_4_SNVS_GPIO                  GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_4_SNVS_GPIO_PIN                  7U   /*!< GPIO pin number */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_4_SNVS_GPIO_PIN_MASK     (1U << 7U)   /*!< GPIO pin mask */

/* GPIO_SNVS_05 (coord P9), DIG_INPUT_5 */
/* Routed pin properties */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_5_SNVS_PERIPHERAL            GPIO13   /*!< Peripheral name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_5_SNVS_SIGNAL               gpio_io   /*!< Signal name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_5_SNVS_CHANNEL                   8U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_5_SNVS_GPIO                  GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_5_SNVS_GPIO_PIN                  8U   /*!< GPIO pin number */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_5_SNVS_GPIO_PIN_MASK     (1U << 8U)   /*!< GPIO pin mask */

/* GPIO_SNVS_06 (coord M9), DIG_INPUT_6 */
/* Routed pin properties */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_6_SNVS_PERIPHERAL            GPIO13   /*!< Peripheral name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_6_SNVS_SIGNAL               gpio_io   /*!< Signal name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_6_SNVS_CHANNEL                   9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_6_SNVS_GPIO                  GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_6_SNVS_GPIO_PIN                  9U   /*!< GPIO pin number */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_6_SNVS_GPIO_PIN_MASK     (1U << 9U)   /*!< GPIO pin mask */

/* GPIO_SNVS_07 (coord R9), DIG_INPUT_7 */
/* Routed pin properties */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_7_SNVS_PERIPHERAL            GPIO13   /*!< Peripheral name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_7_SNVS_SIGNAL               gpio_io   /*!< Signal name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_7_SNVS_CHANNEL                  10U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_7_SNVS_GPIO                  GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_7_SNVS_GPIO_PIN                 10U   /*!< GPIO pin number */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_7_SNVS_GPIO_PIN_MASK    (1U << 10U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDigitalInputPins(void);        /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B2_15 (coord A4), WDOG_B */
/* Routed pin properties */
#define BOARD_INITWDOGPINS_WDOG_B_PERIPHERAL                               WDOG1   /*!< Peripheral name */
#define BOARD_INITWDOGPINS_WDOG_B_SIGNAL                             wdog_wdog_b   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitWdogPins(void);                /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
